Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/industrial_relations_and_trade_unions/index.html.txt.tmx
Source language: en
Languages: ga

source: Industrial relations and trade unions
ga: Caidrimh thionsclaíocha agus ceardchumainn

source: Employees have a right under the Constitution to join a trade union. What is a trade union?
ga: Leagann an doiciméad seo amach cearta an fhostaí maidir le ballraíocht i gceardchumann

source: Read how Joint Labour Committees (JLCs) regulate pay and conditions of employment in certain employment sectors
ga: Léigh conas a rialaigh na Comhchoistí Oibreachais pá agus coinníollacha oibre do fhostaithe i réimsí áirithe fostaíochta

source: Employment Regulation Orders and registered employment agreements
ga: Orduithe Rialaithe Fostaíochta agus comhaontuithe fostaíochta cláraithe

source: Read about the regulation of pay and conditions of employment for certain employment sectors
ga: Léigh faoi na rialacháin pá agus coinníollacha oibre agus pá na bhfostaithe i réimsí áirithe fostaíochta

source: Trade disputes and industrial action
ga: Díospóidí trádála agus gníomhaíocht thionsclaíoch

source: Outlines the law on trade disputes and industrial action and the protections for employees
ga: Tugtar breac-chuntas ar dhíospóidí trádála agus gníomhaíocht thionsclaíoch agus an chosaint atá ann d’fhostaithe

source: Most Read in "Employment"
ga: Ábhar is mó éilimh i "Fostaíocht"

source: Rest periods and breaks
ga: Tréimhsí sosa agus sosanna

source: Tax and starting work - PAYE
ga: Gnó a chur ar bun
